Autodesk.Navisworks.Api.Graphics
Class encapsulating API for the rendering of client graphics.

Autodesk.Navisworks.Api.Graphics.Arc(Autodesk.Navisworks.Api.Point2D,Autodesk.Navisworks.Api.Point2D,Autodesk.Navisworks.Api.Point2D,System.Boolean)
Renders a 2D arc in the XY plane at the current Z depth.
centre: Centre point of the arc.
start: Start point of the arc.
end: End point of the arc.
filled: Should the arc be filled in or an outline.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'centre' is null
Throws System.ArgumentException:
Argument 'centre' has been Disposed
Throws System.ArgumentNullException:
Argument 'start' is null
Throws System.ArgumentException:
Argument 'start' has been Disposed
Throws System.ArgumentNullException:
Argument 'end' is null
Throws System.ArgumentException:
Argument 'end' has been Disposed

Autodesk.Navisworks.Api.Graphics.Arc(Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.Vector3D,System.Boolean)
Renders a 3D arc.
center: Center point of the arc.
start: Start point of the arc.
end: End point of the arc.
normal: Normal for arc.
filled: Should the arc be filled in or an outline.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'center' is null
Throws System.ArgumentException:
Argument 'center' has been Disposed
Throws System.ArgumentNullException:
Argument 'start' is null
Throws System.ArgumentException:
Argument 'start' has been Disposed
Throws System.ArgumentNullException:
Argument 'end' is null
Throws System.ArgumentException:
Argument 'end' has been Disposed
Throws System.ArgumentNullException:
Argument 'normal' is null
Throws System.ArgumentException:
Argument 'normal' has been Disposed

Autodesk.Navisworks.Api.Graphics.BeginComplexPolygon(Autodesk.Navisworks.Api.VertexProperties)
Begin rendering a complex polygon.
vertexProperties: Vertex properties for the polygon.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Graphics.BeginComplexPolygonContour
Begin complex polygon contour.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Graphics.BeginModelContext
Begin rendering in the Model Context.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Graphics.BeginPolygon(Autodesk.Navisworks.Api.VertexProperties)
Begins a convex polygon.
vertexProperties: Vertex properties for the polygon.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Graphics.BeginUserContext
Begin rendering in a user-defined context.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Graphics.BeginWindowContext
Begin rendering in the Window Context.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Graphics.BezierSegment(Autodesk.Navisworks.Api.Point2D,Autodesk.Navisworks.Api.Point2D,Autodesk.Navisworks.Api.Point2D)
Renders a 2D segment of a 3rd order Bezier curve.
start: Start point of the segment.
control: Control point for segment.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'start' is null
Throws System.ArgumentException:
Argument 'start' has been Disposed
Throws System.ArgumentNullException:
Argument 'control' is null
Throws System.ArgumentException:
Argument 'control' has been Disposed
Throws System.ArgumentNullException:
Argument 'end' is null
Throws System.ArgumentException:
Argument 'end' has been Disposed

Autodesk.Navisworks.Api.Graphics.BezierSegment(Autodesk.Navisworks.Api.Point2D,Autodesk.Navisworks.Api.Point2D,Autodesk.Navisworks.Api.Point2D,System.Int32)
Renders a 2D segment of a 3rd order Bezier curve.
start: Start point of the segment.
control: Control point for segment.
resolution: Number of points to evaluate along the Bezier.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'start' is null
Throws System.ArgumentException:
Argument 'start' has been Disposed
Throws System.ArgumentNullException:
Argument 'control' is null
Throws System.ArgumentException:
Argument 'control' has been Disposed
Throws System.ArgumentNullException:
Argument 'end' is null
Throws System.ArgumentException:
Argument 'end' has been Disposed

Autodesk.Navisworks.Api.Graphics.Bitmap(System.Int32,Autodesk.Navisworks.Api.Point2D,System.Double)
Renders a registered bitmap
index: Index of the registered bitmap to render.
origin: Origin point of the bitmap.
alpha: Overall alpha value for the bitmap.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'origin' is null
Throws System.ArgumentException:
Argument 'origin' has been Disposed

Autodesk.Navisworks.Api.Graphics.Bitmap(System.Int32,Autodesk.Navisworks.Api.Point2D,System.UInt32,System.UInt32,System.Double)
Renders a registered bitmap
index: Index of the registered bitmap to render.
origin: Origin point of the bitmap.
width: Width of the image you want to render.
height: Height of the image you want to render.
alpha: Overall alpha value for the bitmap.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'origin' is null
Throws System.ArgumentException:
Argument 'origin' has been Disposed

Autodesk.Navisworks.Api.Graphics.Blend(System.Boolean)
Enables or disables blending.
blendOn: Should blending be enabled.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Graphics.CanRenderText2D(Autodesk.Navisworks.Api.TextFontInfo,System.String)
Check to see if you can render a given text string with given font info.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentException:
Argument 'fontInfo' has been Disposed

Autodesk.Navisworks.Api.Graphics.Circle(Autodesk.Navisworks.Api.Point2D,System.Double,System.Boolean)
Renders a 2D circle in the XY plane at the current Z depth.
centre: Centre point of the circle.
radius: Radius of circle.
filled: Should the circle be filled in or an outline.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'centre' is null
Throws System.ArgumentException:
Argument 'centre' has been Disposed

Autodesk.Navisworks.Api.Graphics.Circle(Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.Vector3D,System.Double,System.Boolean)
Renders a 3D circle in the model space.
centre: Centre point of the circle.
normal: normal for the circle.
radius: Radius of circle.
filled: Should the circle be filled in or an outline.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'centre' is null
Throws System.ArgumentException:
Argument 'centre' has been Disposed
Throws System.ArgumentNullException:
Argument 'normal' is null
Throws System.ArgumentException:
Argument 'normal' has been Disposed

Autodesk.Navisworks.Api.Graphics.Color(Autodesk.Navisworks.Api.Color,System.Double)
Sets the current render color.
colorValue: Color value.
alphaValue: Alpha value. Range of 0.0 to 1.0. 0.0 is fully transparent, 1.0 is fully opaque.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'colorValue' is null
Throws System.ArgumentException:
Argument 'colorValue' has been Disposed

Autodesk.Navisworks.Api.Graphics.Cone(Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.Point3D,System.Double,System.Double)
Renders a 3D cone.
start: Start point of centre axis.
end: End point of centre axis.
startRadius: Radius at start point of cone.
endRadius: Radius at end point of cone.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'start' is null
Throws System.ArgumentException:
Argument 'start' has been Disposed
Throws System.ArgumentNullException:
Argument 'end' is null
Throws System.ArgumentException:
Argument 'end' has been Disposed

Autodesk.Navisworks.Api.Graphics.Cuboid(Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.Vector3D,Autodesk.Navisworks.Api.Vector3D,Autodesk.Navisworks.Api.Vector3D,System.Boolean)
Renders a 3D cuboid.
origin: Origin point of rectangle.
xVector: Vector representing 'x' side of cuboid.
yVector: Vector representing 'y' side of cuboid.
zVector: Vector representing 'y' side of cuboid.
filled: Should the cuboid be filled in or an outline.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'origin' is null
Throws System.ArgumentException:
Argument 'origin' has been Disposed
Throws System.ArgumentNullException:
Argument 'xVector' is null
Throws System.ArgumentException:
Argument 'xVector' has been Disposed
Throws System.ArgumentNullException:
Argument 'yVector' is null
Throws System.ArgumentException:
Argument 'yVector' has been Disposed
Throws System.ArgumentNullException:
Argument 'zVector' is null
Throws System.ArgumentException:
Argument 'zVector' has been Disposed

Autodesk.Navisworks.Api.Graphics.Cylinder(Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.Point3D,System.Double)
Renders a 3D cylinder.
start: Start point of centre axis.
end: End point of centre axis.
radius: Radius of cylinder.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'start' is null
Throws System.ArgumentException:
Argument 'start' has been Disposed
Throws System.ArgumentNullException:
Argument 'end' is null
Throws System.ArgumentException:
Argument 'end' has been Disposed

Autodesk.Navisworks.Api.Graphics.DepthMask(System.Boolean)
Enables or disables depth buffer writing.
depthMaskOn: Should writing to the depth buffer be enabled.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Graphics.DepthTest(System.Boolean)
Enables or disables depth testing.
depthTestOn: Should depth testing be enabled.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Graphics.Ellipse(Autodesk.Navisworks.Api.Point2D,System.Double,System.Double,System.Boolean)
Renders a 2D axis-aligned ellipse in the XY plane at the current Z depth.
centre: Centre point of the ellipse.
xRadius: Length of X radius.
yRadius: Length of Y radius.
filled: Should the ellipse be filled in or an outline.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'centre' is null
Throws System.ArgumentException:
Argument 'centre' has been Disposed

Autodesk.Navisworks.Api.Graphics.Ellipse(Autodesk.Navisworks.Api.Point2D,System.Double,System.Double,System.Boolean,System.Int32)
Renders a 2D axis-aligned ellipse in the XY plane at the current Z depth.
centre: Centre point of the ellipse.
xRadius: Length of X radius.
yRadius: Length of Y radius.
filled: Should the ellipse be filled in or an outline.
resolution: Number of points used to draw ellipse.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'centre' is null
Throws System.ArgumentException:
Argument 'centre' has been Disposed

Autodesk.Navisworks.Api.Graphics.EndComplexPolygon
Ends current complex polygon.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Graphics.EndComplexPolygonContour
Ends current complex polygon contour.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Graphics.EndModelContext
End rendering in the Model context.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Graphics.EndPolygon
End current convex polygon.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Graphics.EndUserContext
End rendering in the User context.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Graphics.EndWindowContext
End rendering in the Window Context.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Graphics.GetFontMetrics(Autodesk.Navisworks.Api.TextFontInfo,Autodesk.Navisworks.Api.TextFontMetrics)
Returns font metrics.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentException:
Argument 'fontInfo' has been Disposed
Throws System.ArgumentException:
Argument 'metrics' has been Disposed

Autodesk.Navisworks.Api.Graphics.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Graphics.Lighting(System.Boolean)
Enables or disables lighting.
lightingOn: Should lighting be enabled.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Graphics.Line(Autodesk.Navisworks.Api.Point2D,Autodesk.Navisworks.Api.Point2D)
Renders a 2D line in the XY plane at the current depth.
point1: First point of line.
point2: Second point of line.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'point1' is null
Throws System.ArgumentException:
Argument 'point1' has been Disposed
Throws System.ArgumentNullException:
Argument 'point2' is null
Throws System.ArgumentException:
Argument 'point2' has been Disposed

Autodesk.Navisworks.Api.Graphics.Line(Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.Point3D)
Renders a 3D line.
start: Start point.
end: End point.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'start' is null
Throws System.ArgumentException:
Argument 'start' has been Disposed
Throws System.ArgumentNullException:
Argument 'end' is null
Throws System.ArgumentException:
Argument 'end' has been Disposed

Autodesk.Navisworks.Api.Graphics.LineStipple(System.Int32,System.UInt16)
Sets the current line stipple mode.
factor: Factor to stretch pattern by. May be clamped.
pattern: Bit pattern to stipple line with.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Graphics.LineWidth(System.Double)
Sets the current line width.
width: line width to render with.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Graphics.Point(Autodesk.Navisworks.Api.Point2D)
Renders a 2D point in the XY plane at the current depth.
point2D: Position to render point.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'point2D' is null
Throws System.ArgumentException:
Argument 'point2D' has been Disposed

Autodesk.Navisworks.Api.Graphics.Point(Autodesk.Navisworks.Api.Point3D)
Renders a 3D point.
point3D: Position to render point.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'point3D' is null
Throws System.ArgumentException:
Argument 'point3D' has been Disposed

Autodesk.Navisworks.Api.Graphics.PolygonTessellationWindingRule
Tessellation winding rule
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Graphics.Polyline2D(Autodesk.Navisworks.Api.Point2DList)
Renders a 2D polyline in the XY plane at the current depth.
points: Array of each point
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'points' is null
Throws System.ArgumentException:
Argument 'points' has been Disposed

Autodesk.Navisworks.Api.Graphics.Polyline3D(Autodesk.Navisworks.Api.Point3DList)
Renders a 3D polyline.
points: Array of each point
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'points' is null
Throws System.ArgumentException:
Argument 'points' has been Disposed

Autodesk.Navisworks.Api.Graphics.Rectangle(Autodesk.Navisworks.Api.Point2D,Autodesk.Navisworks.Api.Point2D,System.Boolean)
Renders a 2D rectangle in the XY plane at the current Z depth.
bottomLeft: Bottom-left coordinate of rectangle.
topRight: Top-right coordinate of rectangle.
filled: Should the rectangle be filled in or an outline.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'bottomLeft' is null
Throws System.ArgumentException:
Argument 'bottomLeft' has been Disposed
Throws System.ArgumentNullException:
Argument 'topRight' is null
Throws System.ArgumentException:
Argument 'topRight' has been Disposed

Autodesk.Navisworks.Api.Graphics.Rectangle(Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.Vector3D,Autodesk.Navisworks.Api.Vector3D,System.Boolean)
Renders a 3D rectangle.
origin: Origin point of rectangle.
xVector: Vector representing 'x' side of rectangle.
yVector: Vector representing 'y' side of rectangle.
filled: Should the rectangle be filled in or an outline.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'origin' is null
Throws System.ArgumentException:
Argument 'origin' has been Disposed
Throws System.ArgumentNullException:
Argument 'xVector' is null
Throws System.ArgumentException:
Argument 'xVector' has been Disposed
Throws System.ArgumentNullException:
Argument 'yVector' is null
Throws System.ArgumentException:
Argument 'yVector' has been Disposed

Autodesk.Navisworks.Api.Graphics.SetTexture(System.Int32)
Set texture image index.
imageId: image index registered by Application.RegisterBitmap API.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.Graphics.Sphere(Autodesk.Navisworks.Api.Point3D,System.Double)
Renders a 3D sphere.
center: Center of sphere.
radius: Radius of sphere.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'center' is null
Throws System.ArgumentException:
Argument 'center' has been Disposed

Autodesk.Navisworks.Api.Graphics.Text2D(Autodesk.Navisworks.Api.TextFontInfo,System.String,Autodesk.Navisworks.Api.Point2D,System.Int32,System.Int32)
Renders 2D text.Text is rendered in 2D as bitmaps. It always faces the viewer.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentException:
Argument 'fontInfo' has been Disposed
Throws System.ArgumentNullException:
Argument 'origin' is null
Throws System.ArgumentException:
Argument 'origin' has been Disposed

Autodesk.Navisworks.Api.Graphics.Text2DExtents(Autodesk.Navisworks.Api.TextFontInfo,System.String)
Returns the extents of 2D text.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentException:
Argument 'fontInfo' has been Disposed

Autodesk.Navisworks.Api.Graphics.TextureCoordinate(Autodesk.Navisworks.Api.Point2D)
Specifies texture co-ordinate for next polygon vertex.
coordinate: Texture co-ordinate.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'coordinate' is null
Throws System.ArgumentException:
Argument 'coordinate' has been Disposed

Autodesk.Navisworks.Api.Graphics.Triangle(Autodesk.Navisworks.Api.Point2D,Autodesk.Navisworks.Api.Point2D,Autodesk.Navisworks.Api.Point2D,System.Boolean)
Renders a 2D triangle in the XY plane at the current Z depth.
point1: First point of triangle.
point2: Second point of triangle.
point3: Third point of triangle.
filled: Should the triangle be filled in or an outline.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'point1' is null
Throws System.ArgumentException:
Argument 'point1' has been Disposed
Throws System.ArgumentNullException:
Argument 'point2' is null
Throws System.ArgumentException:
Argument 'point2' has been Disposed
Throws System.ArgumentNullException:
Argument 'point3' is null
Throws System.ArgumentException:
Argument 'point3' has been Disposed

Autodesk.Navisworks.Api.Graphics.Triangle(Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.Point3D,Autodesk.Navisworks.Api.Point3D,System.Boolean)
Renders a 3D triangle.
point1: First point on triangle.
point2: Second point on triangle.
point3: Third point on triangle.
filled: Should the triangle be filled in or an outline.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'point1' is null
Throws System.ArgumentException:
Argument 'point1' has been Disposed
Throws System.ArgumentNullException:
Argument 'point2' is null
Throws System.ArgumentException:
Argument 'point2' has been Disposed
Throws System.ArgumentNullException:
Argument 'point3' is null
Throws System.ArgumentException:
Argument 'point3' has been Disposed

Autodesk.Navisworks.Api.Graphics.Vertex(Autodesk.Navisworks.Api.Point3D)
Specifies polygon vertex.
coordinate: Vertex co-ordinate.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'coordinate' is null
Throws System.ArgumentException:
Argument 'coordinate' has been Disposed

Autodesk.Navisworks.Api.Graphics.VertexColor(Autodesk.Navisworks.Api.Color,System.Double)
Specifies color of next polygon vertex.
color: Vertex color.
alpha: Vertex alpha value.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'color' is null
Throws System.ArgumentException:
Argument 'color' has been Disposed

Autodesk.Navisworks.Api.Graphics.VertexNormal(Autodesk.Navisworks.Api.Vector3D)
Specifies normal of next polygon vertex.
normal: Vertex normal.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'normal' is null
Throws System.ArgumentException:
Argument 'normal' has been Disposed

Autodesk.Navisworks.Api.Graphics.WindowHeight
Returns height of window.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Graphics.WindowWidth
Returns width of window.
Throws System.ObjectDisposedException:
Object has been Disposed